import Ybyrai from './assets/ybyrai.png'
import Shoqan from './assets/shoqan.png'
import Akhmet from './assets/akhmet.png'

export const initialCategories = [
  {
    name: 'Атаулы күндер',
    tasks: [
      { points: 100, question: '25 қазан', answer: 'Республика күні', image: '' },
      { points: 200, question: '30 Тамыз', answer: 'Конституция күні', image: '' },
      { points: 300, question: '16 Желтоқсан', answer: 'Тәуелсіздік күні', image: '' },
      { points: 400, question: '7 Мамыр', answer: 'Отан қорғаушылар күні', image: '' },
    ],
  },
  {
    name: 'Тәуелсіз Қазақстан',
    tasks: [
      { points: 100, question: 'Қазақстан Республикасы тәуелсіздігін қай жылы алды? Биыл тәуелсіздігімізге неше жыл болады?', answer: 'Қазақстан Республикасы тәуелсіздігін 1991 жылы алды. Биыл тәуелсіздігімізге 33 жыл болады.', image: '' },
      { points: 200, question: 'Қазақстан Республикасының туының авторы кім?', answer: 'Қазақстан Республикасының туының авторы суретші Шәкен Ниязбеков.', image: '' },
      { points: 300, question: 'Қазақстан Республикасының Әнұранының авторларын ата.', answer: 'Сөзін жазғандар: Жұмекен Нәжімеденов пен Нұрсұлтан Назарбаев.  Әнін жазған: Сазгер Шәмші Қалдаяқов.', image: '' },
      { points: 400, question: 'Қазақстан Республикасының Елтаңбасының авторлары кім?', answer: 'Қазақстан Республикасының Елтаңбасының авторлары – белгілі сәулетшілер Жандарбек Мәлібеков пен Шот-Аман Уәлиханов', image: '' },
    ],
  },
  {
    name: 'Тарих',
    tasks: [
      { points: 100, question: 'Қазақ хандығы қай ғасырда құрылды?', answer: 'XV ғасырда Жәнібек пен Керей хандары құрды.', image: '' },
      { points: 200, question: 'Қай жылы Қазақстан Республикасының астанасы Алматыдан Астанаға көшірілді?', answer: 'Қазақстан Республикасының астанасы 1997 жылы Алматыдан Астанаға  ауыстырылды', image: '' },
      { points: 300, question: 'Қазақстан Республикасының президенті кім? Қай жылдан бастап сайланды?', answer: 'Қазақстан Республикасының президенті Қасым-Жомарт Кемелұлы Тоқаев. Ол 2019 жылдан бастап Қазақстан Республикасының Президенті.', image: '' },
      { points: 400, question: 'Қазақстан Республикасының тұңғыш президенті кім? Қай жылдар аралығында президент болып елді басқарды?', answer: 'Қазақстан Республикасының тұңғыш президенті Нұрсылтан Әбішұлы Назарбаев. Тұңғыш Президент 1991 жылғы 16 желтоқсаннан 2019 жылғы 20 наурызға дейін елді басқарды.', image: '' },
    ],
  },
  {
    name: 'Атақты тұлға',
    tasks: [
      { points: 100, question: 'Абай Құнанбаев кім? Қай жылдар аралығында өмір сүрген?', answer: 'Абай Құнанбаев — қазақ ақыны, философ, музыкант, халық ағартушысы, қоғам қайраткері. Ол қазақ жазба әдебиетінің негізін қалаушы.Абай Құнанбаев өз шығармаларын ұлттың бірлігіне, Отанға, табиғатқа арнаған. Ақынның шын есімі — Ибраһим, бірақ Зере әжесі оны Абай деп атаған. Абай Құнанбаев 1845 –1904 жылдар аралығында өмір сүрген.', image: '' },
      { points: 200, question: 'Бұл кімнің суреті?', answer: 'Ыбырай Алтынсарин. Ол  ақын, ағартушы, жаңашыл ұстаз және жаңа мектептерді ұйымдастырушы.', image: Ybyrai },
      { points: 200, question: 'Бұл кім?', answer: 'Шоқан (Мұхамедханафия) Шыңғысұлы Уәлиханов. Қазақтың ұлы ғалымы,  тарихшы, этнолог, географ, суретші.', image: Shoqan },
      { points: 300, question: 'Бұл кімнің бейнесі? Білесің бе?', answer: 'Тұңғыш қазақ балаларына арнап әліппе жазған белгілі ұстаз- А.Байтұрсынұлы', image: Akhmet},
    ],
  },
];
