import Ybyrai from './assets/ybyrai.png'
import Shoqan from './assets/shoqan.png'
import Akhmet from './assets/akhmet.png'
import Qyzdar from './assets/qyzdar.png'

export const initialCategories = [
  {
    name: 'Атаулы күндер',
    tasks: [
      { points: 100, question: '25 қазан', answer: 'Республика күні', image: '' },
      { points: 200, question: '30 Тамыз', answer: 'Конституция күні', image: '' },
      { points: 300, question: '16 Желтоқсан', answer: 'Тәуелсіздік күні', image: '' },
      { points: 400, question: '7 Мамыр', answer: 'Отан қорғаушылар күні', image: '' },
    ],
  },
  {
    name: 'Тәуелсіз Қазақстан',
    tasks: [
      { points: 100, question: 'Қазақстан Республикасы тәуелсіздігін қай жылы алды? Биыл тәуелсіздігімізге неше жыл болады?', answer: 'Қазақстан Республикасы тәуелсіздігін 1991 жылы алды. Биыл тәуелсіздігімізге 33 жыл болады.', image: '' },
      { points: 200, question: 'Қазақстан Республикасының туының авторы кім?', answer: 'Қазақстан Республикасының туының авторы суретші Шәкен Ниязбеков.', image: '' },
      { points: 300, question: 'Қазақстан Республикасының Әнұранының авторларын ата.', answer: 'Сөзін жазғандар: Жұмекен Нәжімеденов пен Нұрсұлтан Назарбаев.  Әнін жазған: Сазгер Шәмші Қалдаяқов.', image: '' },
      { points: 400, question: 'Қазақстан Республикасының Елтаңбасының авторлары кім?', answer: 'Қазақстан Республикасының Елтаңбасының авторлары – белгілі сәулетшілер Жандарбек Мәлібеков пен Шот-Аман Уәлиханов', image: '' },
    ],
  },
  {
    name: 'Тарих',
    tasks: [
      { points: 100, question: 'Қазақ хандығы қай ғасырда құрылды?', answer: 'XV ғасырда Жәнібек пен Керей хандары құрды.', image: '' },
      { points: 200, question: 'Қай жылы Қазақстан Республикасының астанасы Алматыдан Астанаға көшірілді?', answer: 'Қазақстан Республикасының астанасы 1997 жылы Алматыдан Астанаға  ауыстырылды', image: '' },
      { points: 300, question: 'Қазақстан Республикасының президенті кім? Қай жылдан бастап сайланды?', answer: 'Қазақстан Республикасының президенті Қасым-Жомарт Кемелұлы Тоқаев. Ол 2019 жылдан бастап Қазақстан Республикасының Президенті.', image: '' },
      { points: 400, question: 'Қазақстан Республикасының тұңғыш президенті кім? Қай жылдар аралығында президент болып елді басқарды?', answer: 'Қазақстан Республикасының тұңғыш президенті Нұрсылтан Әбішұлы Назарбаев. Тұңғыш Президент 1991 жылғы 16 желтоқсаннан 2019 жылғы 20 наурызға дейін елді басқарды.', image: '' },
    ],
  },
  {
    name: 'Атақты тұлға',
    tasks: [
      { points: 100, question: 'Абай Құнанбаев кім? Қай жылдар аралығында өмір сүрген?', answer: 'Абай Құнанбаев — қазақ ақыны, философ, музыкант, халық ағартушысы, қоғам қайраткері. Ол қазақ жазба әдебиетінің негізін қалаушы.Абай Құнанбаев өз шығармаларын ұлттың бірлігіне, Отанға, табиғатқа арнаған. Ақынның шын есімі — Ибраһим, бірақ Зере әжесі оны Абай деп атаған. Абай Құнанбаев 1845 –1904 жылдар аралығында өмір сүрген.', image: '' },
      { points: 200, question: 'Бұл кімнің суреті?', answer: 'Ыбырай Алтынсарин. Ол  ақын, ағартушы, жаңашыл ұстаз және жаңа мектептерді ұйымдастырушы.', image: Ybyrai },
      { points: 300, question: 'Бұл кім?', answer: 'Шоқан (Мұхамедханафия) Шыңғысұлы Уәлиханов. Қазақтың ұлы ғалымы,  тарихшы, этнолог, географ, суретші.', image: Shoqan },
      { points: 400, question: 'Бұл кімнің бейнесі? Білесің бе?', answer: 'Тұңғыш қазақ балаларына арнап әліппе жазған белгілі ұстаз- А.Байтұрсынұлы', image: Akhmet},
    ],
  },
  {
    name: 'Ел мақтанышымыз',
    tasks: [
      { points: 100, question: 'Қазақстан спортшылары Париж олимпиадасынан қанша қанша медаль алып қайтты? Алтын медальді кім, қай спорт түрінен алды?', answer: 'Қазақстан спортшылары Париж олимпиадасынан жеті  медаль алып қайтты. Бір алтын, үш күміс, үш қола медельмен оралды. Алтын медальді дзюдодан Елдос Сметов иеленіп, олимпиада чемпионы атанды.', image: '' },
      { points: 200, question: 'Қазақстан Республикасы жер көлемінен әлем бойынша нешінші орында тұр?', answer: 'Қазақстан Республикасы жер көлемінен тоғызыншы орында тұр. Жер көлемі 2 млн 724 мың км2', image: '' },
      { points: 300, question: 'Қазақтан шыққан ғарышкерлерді ата.', answer: 'Тоқтар Әубәкіров, Талғат Мұсабаев және Айдын Айымбетов.', image: '' },
      { points: 400, question: 'Қазақ елінің мақтанышына айналған батыр қыздарымыздың есімдерін ата.', answer: 'Қазақтың батыр қыздары: Хиуаз Доспанова- ұшқыш, Мәншүк Мәметова пулеметшы, Әлия Молдағұлова - мерген. Кеңес одағының батырлары.', image: Qyzdar},
    ],
  },
  {
    name: 'Біздің өңір',
    tasks: [
      { points: 100, question: 'Қаламыздағы орталық саябақ кімнің атында?', answer: 'Қоғам қайраткері Сұлтанбек Қожанов атында.', image: '' },
      { points: 200, question: 'Түркістан қаласы қай жылдан бастан облыс орталығы болды?', answer: 'Түркістан қаласы 2018 жылдан бастан облыс орталығы болды', image: '' },
      { points: 300, question: '«Қаратау тәжі» атанған Кентау қаламыз қай жылы құрылған? Бұрынғы атауы қандай?', answer: '«Қаратау тәжі» деп аталатын жасыл желекті қала 1955 жылы құрылған. Бұрынғы атауы Мырғалымсай', image: '' },
      { points: 400, question: 'Қожа Ахмет Яссауи кесенесі қай қалада орналасқан? Кесенені салдырған кім?', answer: 'Түркістан қаласында орналасқан.  XIV ғасырдың аяғында атақты Ақсақ Темір кесенені  салдырды', image: ''},
    ],
  },

];
